[Killed] StringLiteral
src/lib/providers/gmail.ts:4:28
 import { IProvider } from './provider.interface';
 
 const GMAIL_DOT_COM = 'gmail.com';
-const GOOGLEMAIL_DOT_COM = 'googlemail.com';
+const GOOGLEMAIL_DOT_COM = "";
 const AT_GMAIL_DOT_COM = `@${GMAIL_DOT_COM}`;
 
killedBy: Providers/Gmail should not affect normalized email addresses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "johndoe@gmail.com"
Received: "gmailcomjohndoe@gmail.com"

[Killed] MethodExpression
src/lib/providers/gmail.ts:11:12
   // eslint-disable-next-line class-methods-use-this
   getNormalizedAddress(emailAddress: string): string {
     // TODO: Optimize me
-    return emailAddress
-      .toLowerCase()
+    return emailAddress.toUpperCase()
       .replace(GOOGLEMAIL_DOT_COM, GMAIL_DOT_COM)
       .replace(/(\+[^@]+)/, '')
killedBy: Providers/Gmail should not affect normalized email addresses
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "johndoe@gmail.com"
Received: "JOHNDOE@GMAILCOM@gmail.com"
